/* sample input
BBBWW

WWWWWW

WBWBWBWBWB
*/

/* 実装方針
盤面を、同じ色の石が連続して並ぶ区間に分割して考える。

たとえば BBBWWB なら (黒 3, 白 2, 黒 1) のよう に見る。
このように見ると、石の並びには白と黒の区間が交互に現れると捉えることが出来る。

石を新たにひとつ打つことで何ができるかを考えると、
これは左端か右端にある連続する同じ色の石たちの 色をすべて反転させる操作である。

白の区間と黒の区間は交互に現れるので、端の区間の色を反転させると、
それは隣の区間とくっついて全体として区間数が 1 減ることになる。

最終的に区間の数を 1 にすることが目的で、石をひとつ打つことで区間数を 1 減らせるから、
必要な石の個数は (区間の数) − 1 個である。

したがって区間の数を求めればよく、これはたとえば隣接する石の色が異なるような箇所がいくつあるかを数えると求められる。
*/

#include <bits/stdc++.h> 
using namespace std;
typedef long long ll; 
#define rep(i, n) for (int i = 0; i < (int)(n); i++)

int main(){
    // 初期値
    string s;
    char ch;
    int count=1;
    cin >> s;

    ch=s[0];

    for(int i=0; i<s.size(); i++){
        if(ch!=s[i]){
            count++;
        }
        ch=s[i];
    }

    // cout << count << endl;

    // 出力
    cout << count-1 << endl;
}

/* 参考回答

*/