/* sample input
2 2

1 10

10 8
*/

/* 実装方針
まず左端のボールに塗る色を決めます。
これは K 通りあります。

さらに左から順番に塗る色を決めていきます。
この時、これまでどのように塗っていようが、
”ひとつ左のボールに塗られている色”以外の K−1 通りの色が塗れる

ので、全体ではK·(K−1)N−1 通りになります。

答えが大きいので、塗り方をすべて試す方法では間に合いません。
*/

#include <bits/stdc++.h> 
using namespace std;
#define rep(i, n) for (int i = 0; i < (int)(n); i++)

int main(){
    // 初期値
    // ボールn個、ペンキの色k色
    long long int n, k, ans;
    cin >> n >> k;

    // 入力
    // 一番最初のボールを塗れる色の数は、そのままk通りになる
    // そのため、まずはansにkを代入する
    ans=k;

    // 処理
    // ansに、(k-1)を(n-1)乗したものを掛けることで、指定条件における全通り数が把握できる
    ans *= pow(k-1, n-1);

    // 出力
    cout << ans << endl;
}

/* 参考回答

*/