/* sample input
9 45000

*/

#include <bits/stdc++.h> 
using namespace std;
#define rep(i, n) for (int i = 0; i <= (int)(n); i++)

int main() {
    // 初期値定義
    int n, yen;
    cin >> n >> yen;

    // 処理定義
    // はじめに、10000円の枚数を全探索する
    for(int i=0; i<=n; i++){

        // 次に、5000円の枚数を探索するのだが、
        // 探索している10000円と5000円の枚数の合計がnより多くなることはありえないという性質がある
        // これを利用して、5000円の枚数の探索数を減らして計算量を少なくしている
        // 下記の「j + i <= n」はその実装例である
        for(int j=0; j+i<=n; j++){

            // あとは、1000円の枚数を求める
            // のだが、すでに10000円と5000円の枚数は定まっており、お札の合計枚数も決まっている
            // つまり、お札の合計枚数nから、10000円の枚数iと、5000円の枚数jを引けば、自ずと1000円の枚数も導き出せるのである
            // したがって、1000円の枚数に関しては、ループによる全探索をする必要すらないのである
            // 下記の「int k = n - i - j」はその実装例である
            int k = n - i - j;
            if(i*10000 + j*5000 + k*1000 == yen){
                printf("%d %d %d\n", i, j, k);
                return 0;
            }            
        }
    }

    // 出力定義
    printf("-1 -1 -1\n");
    return 0;
}