/* sample input
3 3 2 4
...
...
.#.
1 0 0
2 2 0
1 0 2
2 2 2

20 20 5 50
.....#..............
....................
....................
.#..................
#...................
.........#..........
........#.#.........
............#.......
....................
.....#..............
.#..................
....................
............#.......
....#...............
...................#
....................
.................#..
....................
....#...........#..#
...........#.#......
3 18 14
1 15 17
4 11 10
4 14 14
5 5 6
3 17 3
3 17 19
4 15 2
2 18 13
4 6 6
1 1 7
5 6 15
5 6 14
3 15 17
4 16 10
1 9 6
4 9 15
1 1 10
3 16 5
5 16 3
5 7 11
4 4 2
1 2 2
1 3 7
1 15 16
1 14 0
4 18 0
3 8 12
3 7 4
2 13 2
3 8 6
1 16 1
2 12 3
2 12 7
4 4 8
2 3 13
4 14 9
5 12 18
3 8 0
5 8 15
1 17 18
2 18 0
4 16 1
3 3 6
2 8 2
2 2 6
4 6 6
1 11 8
4 7 4
3 8 5
*/

/* 実装方針

*/

#include <bits/stdc++.h> 
using namespace std;
#define rep(i, n) for (int i = 0; i < (int)(n); i++)

int main(){
    // 初期値
    int h, w, mn, tn, y, x;
    char pn;
    cin >> h >> w >> mn >> tn;
    vector<string> bd(h);
    
    // 入力
    rep(i, h) cin >> bd[i];   
    
    for(int l=0; l<tn; l++){
        cin >> pn >> y >> x;

        bd[y][x]=pn;
        
        for (int i =-1; i<=1; i+=2){
            for (int j=1; ; j++){

                if(x+(i*j)==-1 || x+(i*j)==w || y+(i*j)==-1 || y+(i*j)==h || bd[y+(i*j)][x+(i*j)]=='#'){
                    break;
                }

                if(bd[y+(i*j)][x+(i*j)]==pn){
                    for (int k=min(y+(i*j), y); k<=max(y+(i*j), y); k++){
                        bd[k][k-y+x]=pn;
                    }
                    break;
                }

            }
        }

        for (int i=-1; i<=1; i+=2){
            for (int j=1; ; j++){

                if(x+(i*j)==-1 || x+(i*j)==w || y-(i*j)==-1 || y-(i*j)==h || bd[y-(i*j)][x+(i*j)]=='#'){
                    break;
                }

                if(bd[y-(i*j)][x+(i*j)]==pn){
                    for(int k=min(x+i*j, x); k<=max(x+i*j, x); k++){
                        bd[y+x-k][k]=pn;
                    }
                    break;
                }
            }
        }

        for (int i=-1; i<=1; i+=2){
            for (int j=1; ; j++){

                if(y+(i*j)==-1 || y+(i*j)==h || bd[y+(i*j)][x]=='#'){
                    break;
                }

                if(bd[y+(i*j)][x]==pn){
                    for (int k=min(y+(i*j), y); k<=max(y+(i*j), y); k++){
                        bd[k][x]=pn;
                    }
                    break;
                }
            }
        }

        for (int i=-1; i<=1; i+=2){
            for (int j = 1; ; j++){

                if(x+(i*j)==-1 || x+(i*j)==w || bd[y][x+(i*j)]=='#'){
                    break;
                }

                if(bd[y][x+(i*j)]==pn){
                    for (int k=min(x+i*j, x); k<=max(x+i*j, x); k++){
                        bd[y][k]=pn;
                    }
                    break;
                }
            }
        }
    }

    // 出力
    rep(i, h){
        cout << bd[i] << endl;
    }
}

/* 参考回答

*/